//
//  main.swift
//  Number-2
//
//  Created by user on 09.11.16.
//  Copyright © 2016 user. All rights reserved.
//

import Foundation
/*Риби діляться на два типи: звичайних та хижих.
Звичайна рибина має вагу від 1 до 9 кг.
Хижа рибина має вагу 10 кг.
Якщо хижа риба з'їдає звичайну - то до ваги хижої риби додається вага з'їденої.
Звичайні риби не можуть їсти інших.


1) Спочатку в акваріум запускають випадкову кількість звичайних риб (від 10 до 50 штук).
2) Потім запускають двох хижаків.
3) Хижаки їдять випадкових риб до тих пір поки не з'їдять всих. Хижаки один одного їсти не можуть.
 В кінці треба вивести кількість з’їдених риб та вагу кожного з хижаків. (Їм можна дати імена, щоб розрізняти)
 Переміг той хижак в кого більша вага.
*/

var aquarium = Aquarium()   // Створюю акваріум
aquarium.generateGoodFish() // Запускаю хороших рибок
aquarium.aquariumLife()     // Запускаю процес харчування :)
